# -*- coding: utf-8 -*-
p35 = '王子见师父脸色变了，慌忙让膳官带师父到宝纱亭吃斋。师父谢过恩辞了王下到殿，与徒弟到亭内埋怨八戒道你这位夯货全然不懂礼体，索性不开口便罢，怎这般粗鲁一句话冲倒泰山。行者笑说还是我不唱喏省些力气。沙僧说他又没等齐就先打着嘴吆喝。八戒说师父前日教我见人打问讯是礼，今日打问讯又说不好教我怎干。三藏说我教你见人问讯没教你见王子就起衅，物有几等物人有几等人如何不分贵贱。正说处膳官带人役来摆桌设斋，师徒都不言语各自吃斋。那王子退殿进宫，宫中有三个小王子见他容色改了，即问父王今日为何惊恐。子王道适才有东土大唐来拜佛取经的和尚来换关文，一表非凡我留他吃斋，他说有徒弟在府前我即命请，少时进来见我做大礼打问讯已不快，及抬头看时一个个丑似妖魔心中不觉惊骇，故此面容改色。那三个小王子与众不同一个个好武好强，即伸拳捋袖说莫敢是那山里走来的妖精假妆人像，待我们拿兵器出去看来。好王子大个的拿一条齐眉棍，第二个轮一把九齿耙，第三个使一根乌油黑棒子，雄纠纠气昂昂走出王府，吆喝到取经的和尚在那里。有膳官人等报下道小王爷他们在这宝纱亭吃斋哩。'
print('p35 len:', len(p35), 'target: 485')
